fast_finish_2026/LR6/nozzleShockFluidFresh/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-1.188030359 0           -0.002)
    ( 0           0           -0.002)
    ( 0.152328201 0           -0.002)
    (-1.188030359 0.195931015 -0.002)
    ( 0           0.050059229 -0.002)
    ( 0.152328201 0.088038915 -0.002)
    (-1.188030359 0            0.002)
    ( 0           0            0.002)
    ( 0.152328201 0            0.002)
    (-1.188030359 0.195931015  0.002)
    ( 0           0.050059229  0.002)
    ( 0.152328201 0.088038915  0.002)
);

blocks
(
    hex (0 1 4 3 6 7 10 9)  (120 40 1) simpleGrading (0.30 0.25 1)
    hex (1 2 5 4 7 8 11 10) (80 40 1) simpleGrading (4.00 0.25 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 6 9 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 5 11 8)
        );
    }
    axis
    {
        type symmetryPlane;
        faces
        (
            (0 1 7 6)
            (1 2 8 7)
        );
    }
    wall
    {
        type wall;
        faces
        (
            (3 9 10 4)
            (4 10 11 5)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 4 1)
            (1 4 5 2)
            (6 7 10 9)
            (7 8 11 10)
        );
    }
);


// ************************************************************************* //
